#### Q1. What is a database? Differentiate between SQL and NoSQL databases.

In [ ]:
# -->Database is place where we can store millions or billions of data in differents ways.

# ->SQL database stands from Structured Query Language. And NoSQL database stands from Non Structured Query Language.
# ->SQL database in the form of relations. Where nosql database in the form of distributed data or no relational form.
# ->SQL database display data in form of tables that is collection of rows and column. Where Nosql database display
#    data in form of key-values pair, graph, documents.
# ->SQL databases have fixed or static or predefined schema. where NoSQL databases have dynamic schema.
# ->SQL database Ex:MySQL,MSSQL,Oracle etc. Where NoSQL database Ex:MongoDB,Redis,Neo4j,BigTable etc.

#### Q2. What is DDL? Explain why CREATE, DROP, ALTER, and TRUNCATE are used with an example.

In [ ]:
# --> DDL stands from Data Definition Language. 
# ->CREATE, DROP, ALTER, and TRUNCATE are DDL commads.That is used to perform different task such as
# ->CREATE - to create a database and its objects like (table, index, views, store procedure, function, and triggers)
#           Ex: CREATE DATABASE dtabase1;
# ->ALTER - This command is used to add, delete or change columns in the existing table.
#           Ex: ALTER TABLE Table1 ADD Address VARCHAR(50);
# ->DROP - delete objects from the database
#           Ex: DROP TABLE Address;
# ->TRUNCATE - This command is used to remove all rows from the table, but the structure of the table still exists.
#           Ex: TRUNCATE TABLE Address;

#### Q3. What is DML? Explain INSERT, UPDATE, and DELETE with an example.

In [ ]:
# -->DML stands from Data Manipulation Language. 
# -->DML commands such as INSERT, UPDATE, and DELETE.

# ->INSERT:- It is used to insert new row data into a table.There are two ways of using the SQL INSERT statement.
#         1.Only values: The value of data without inserted column names.
            
#             Syntax: INSERT INTO table_name values();
#             Ex:INSERT INTO Student VALUES ('5','HARSH','WEST BENGAL','XXXXXXXXXX','19');
        
#         2.Column name and values: Specify both column name and values.
            
#             Syntax: INSERT INTO table_name (c1,c2,c3,..) VALUES (v1,v2,v3,..);
#             Ex:INSERT INTO Student (ROLL_NO, NAME, Age) VALUES ('5','PRATIK','19');
        
# ->UPDATE:- It is used to update existing data within a table.We can update single columns as well as multiple 
#         columns using the UPDATE statement as per our requirement.
        
#         Syntax:UPDATE table_name SET column1 = value1, column2 = value2;
#             Ex:Update the column NAME and set the value to ‘Nitin’ in the rows where the Age is 22
#                 UPDATE Customer SET CustomerName = 'Nitin' WHERE Age = 22;
        
# ->DELETE:- Existing records in a table can be deleted using the SQL DELETE Statement. We can delete a single 
#         record or multiple records depending on the condition we specify in the WHERE clause.
        
#         Syntax: DELETE FROM table_name WHERE some_condition;
#             Ex:Delete the rows where NAME = ‘Rithvik’. This will delete only the fourth row.
#                 DELETE FROM Employees WHERE Name = 'Bhumil';

#### Q4. What is DQL? Explain SELECT with an example.

In [ ]:
DQL stands from Data Query Language.
SELECT command used in DQL.
SELECT statements in SQL is used to retrieve or fetch data from a database.

Syntax:  SELECT * FROM table_name; 
        asterisks(*) represent all attributes of the table
        
        Ex:To fetch all the fields from the table Customer:
            SELECT * FROM Customer;

#### Q5. Explain Primary Key and Foreign Key.

In [ ]:
Primary Key: There is only one primary key in each and every relation.
It is a unique key.
It can identify only one tuple (a record) at a time.
It has no duplicate values, it has unique values.
It cannot be NULL.
Primary keys are not necessarily to be a single column; more than one column can also be a primary key for a table
 Example:
    STUDENT table -> Student(STUD_NO, SNAME, 
    ADDRESS, PHONE) , STUD_NO is a primary key

Foreign Key: It is a key it acts as a primary key in one table and it acts as secondary key in another table.
It combines two or more relations (tables) at a time.
They act as a cross-reference between the tables.
For example, DNO is a primary key in the DEPT table and a non-key in EMP

#### Q6. Write a python code to connect MySQL to python. Explain the cursor() and execute() method.

In [ ]:
Python code:
import mysql.connector
mydb = mysql.connector.connect(
  host="localhost",
  user="abc",
  password="password"
)
print(mydb)
mycursor = mydb.cursor()
mycursor.execute("SHOW DATABASES")

cursor(): This function is used to fatch databases, tables, table's objects etc.  
execute(): this function is used for the dynamic execution of Python program which can either be a string or object code.

#### Q7. Give the order of execution of SQL clauses in an SQL query.

In [ ]:
# 1.FROM clause
# 2.ON clause
# 3.OUTER clause
# 4.WHERE clause
# 5.GROUP BY clause
# 6.HAVING clause
# 7.SELECT clause
# 8.DISTINCT clause
# 9.ORDER BY clause
# 10.TOP clause